// Задача 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

// string number = Console.ReadLine();
// Console.WriteLine("enter a number: ");


// {
//     if (number[0] == number[4] && number[1] == number[3])
//     {
//         Console.WriteLine($"your number: {number} is palindrome");
//     }
//     else
//     {
//         Console.WriteLine($"your number: {number} is not a palindrome");
//     }
// }




// Задача 21. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

// double ShowDistance(double x1, double x2, double y1, double y2, double z1, double z2)
// {
//     double lineX = x2 - x1;
//     double lineY = y2 - y1;
//     double lineZ = z2 - z1;

//     double DistQuad = lineX*lineX + lineY*lineY + lineZ*lineZ;
//     double result = Math.Sqrt(DistQuad);
//     return result;
// }


// Console.Write("enter x coordinate: "); 
// int x0 = Convert.ToInt32(Console.ReadLine());

// Console.Write("enter y coordinate: ");
// int y0 = Convert.ToInt32(Console.ReadLine());

// Console.Write("enter z coordinate: ");  
// int z0 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("distance between two points in 3d is: " + ShowDistance);

//-----------------------------------------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------------------------------------
// Не выполняется программа. Дает ввести координаты и выдает результат, на такой: 
// distance between two points in 3d is System.Func`7[System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double]
// -----------------------------------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------------------------------------
// Задача 23. Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

// void Cube (int N)
//    {
//     Console.Write("imput number: ");
//     int x = Convert.ToInt32(Console.ReadLine());
//     int y; 
//     int count = 0;
//     int N = 1;
    
//     while (count<x)
//     {
//       y=N*N*N;
//       Console.Write(y);
//       N++;
//       count++;
//     }
//    }


//-----------------------------------------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------------------------------------
// Код по последней задаче вообще не работает. Не могу понять почему, но всё равно отправлю вам, может быть дадите советы.
// Думаю, что мне нужны дополнительные занятия. Чем дальше, тем хуже понимаю. На каждую задачу уходит очень много времени.
// Не подскажете, по вопросу доп. занятий мне лучше в гикбрейнс обратиться?
// -----------------------------------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------------------------------------






























